Обработки/Reports/_ОтчетПоАктивамДляЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоАктивамДляЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоАктивамДляЦБ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет по активам для ЦБ",
		"1.20",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не (ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан счет ДУ!");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
			
	Настройки = КомпоновщикНастроек.Настройки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", 								ЭтотОбъект.Период);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачалаПериодаМинусМесяц", 			ДобавитьМесяц(ЭтотОбъект.Период.ДатаНачала, -1));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", 							КонецДня(ЭтотОбъект.Период));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 							ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮрФизЛицо",								ЭтотОбъект.Организация.ЮрФизЛицо);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидДоговораДоверительногоУправления",	ЭтотОбъект.ВидДоговораДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления",			ЭтотОбъект.СчетДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЦельРасчета",							Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
	
	ПараметрыШапки = ПолучитьПараметрыШапки();
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеУК",							ПараметрыШапки.НаименованиеУК);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеКлиента",					ПараметрыШапки.НаименованиеКлиента);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора",							?(ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления), ПараметрыШапки.НомерДоговора + " от " + Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy") + " г.", ""));
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ПараметрыВыводаПодписей);

КонецПроцедуры

Функция ПолучитьПараметрыШапки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _КлиентыДоверительногоУправления
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|			&ДатаОкончанияПериода,
	|			СчетДоверительногоУправления.Организация = &Организация
	|				И ВЫБОР
	|					КОГДА &СчетДоверительногоУправления <> ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.)
	|						ТОГДА СчетДоверительногоУправления = &СчетДоверительногоУправления
	|					КОГДА &ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.)
	|						ТОГДА СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
	|								И Клиент = &ЮрФизЛицоКлиента
	|					ИНАЧЕ Клиент = &ЮрФизЛицоКлиента
	|				КОНЕЦ) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК НаименованиеУК,
	|	_КлиентыДоверительногоУправления.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
	|	_КлиентыДоверительногоУправления.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, """") КАК НаименованиеКлиента
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|			&ДатаОкончанияПериода,
	|			ЮрФизЛицо = &ЮрФизЛицо
	|				И Организация = &Организация
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
	|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончанияПериода,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
	|		ПО _КлиентыДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончанияПериода,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
	|		ПО _КлиентыДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо";
	
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", 					КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("Организация", 							ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", 								ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ЮрФизЛицоКлиента",						ЭтотОбъект.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления",	ЭтотОбъект.ВидДоговораДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",			ЭтотОбъект.СчетДоверительногоУправления);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции
